[["Spiral","The inhabitants of a small Japanese town become increasingly obsessed with and tormented by spirals."],["Possession","A woman starts exhibiting increasingly disturbing behavior after asking her husband for a divorce. Suspicions of infidelity soon give way to something much more sinister."],["The Man Who Laughs","When a proud noble refuses to kiss the hand of the despotic King James in 1690, he is cruelly executed and his son surgically disfigured."],["Strange Circus","The erotic novelist Taeko is writing a morbid story of a family destroyed by incest, murder and abuse. Her assistant, Yuji, sets on a mission to uncover the reality of this story, but the reality might be too much to bear."],["Who Can Kill a Child?","A couple of English tourists arrive on an island where all the children have gone crazy and are murdering the adults."],["Jacob's Ladder","Mourning his dead child, a haunted Vietnam War veteran attempts to uncover his past while suffering from a severe case of dissociation. To do so, he must decipher reality and life from his own dreams, delusions, and perceptions of death."],["Paperhouse","A young girl lost in the loneliness and boredom of reality finds solace in an ill boy, whom she can visit in a surreal dream world that she drew in her school composition book."],["The Midnight Meat Train","A photographer's obsessive pursuit of dark subject matter leads him into the path of a serial killer who stalks late night commuters, ultimately butchering them in the most gruesome ways imaginable."],["The Innocents","A young governess for two children becomes convinced that the house and grounds are haunted."],["The Addiction","A New York philosophy grad student turns into a vampire after getting bitten by one, and then tries to come to terms with her new lifestyle and frequent craving for human blood."],["In the Mouth of Madness","An insurance investigator begins discovering that the impact a horror writer's books have on his fans is more than inspirational."],["Lake Mungo","Strange things start happening after a girl is found drowned in a lake."],["In the Realm of the Senses","A passionate telling of the story of Sada Abe, a woman whose affair with her master led to a sexual obsession which then came to a violent end."],["Don't Look Now","A married couple grieving the recent death of their young daughter are in Venice when they encounter two elderly sisters, one of whom is psychic and brings a warning from beyond."],["Thesis","While doing a thesis about violence, Ángela finds a snuff video where a girl is tortured until death. Soon she discovers that the girl was a former student in her faculty..."],["Chained","A young man held prisoner by a cab-driving serial killer must make a life or death choice between following in his captor's footsteps or breaking free."],["Session 9","Tensions rise within an asbestos cleaning crew as they work in an abandoned mental hospital with a horrific past that seems to be coming back."],["The House of the Devil","In 1983, financially struggling college student Samantha Hughes takes a strange babysitting job that coincides with a full lunar eclipse. She slowly realizes her clients harbor a terrifying secret, putting her life in mortal danger."],["The Girl Next Door","Follows the unspeakable torture and abuses committed on a teenage girl in the care of her aunt and the boys who witness and fail to report the crime."],["Splinter","Trapped in an isolated gas station by a voracious Splinter parasite that transforms its still-living victims into deadly hosts, a young couple and an escaped convict must find a way to work together to survive this primal terror."],["The Company of Wolves","A teenage girl in a country manor falls asleep while reading a magazine, and has a disturbing dream involving wolves prowling the woods below her bedroom window."],["Raw Meat","When a government official disappears in the London tunnels, after several reports of missing people in the same location, Scotland Yard start to take the matter seriously, along with a couple who stumble into a victim by accident."],["Eyes Without a Face","A surgeon causes an accident which leaves his daughter disfigured, and goes to extremes to give her a new face."],["The Blob","A deadly entity from space crashes near a small town and starts to consume anyone in its path. Panic ensues, as shady government scientists try to contain the horrific creature."],["Curse of the Demon","American professor John Holden arrives in London for a parapsychology conference, only to find himself investigating the mysterious actions of Devil-worshiper Julian Karswell."],["Dust Devil","A woman on the run from her abusive husband encounters a mysterious hitch-hiker."],["Trouble Every Day","Two American newlyweds in Paris experience a love so strong, it almost devours them."],["Nosferatu the Vampyre","Count Dracula moves from Transylvania to Wismar, spreading the Black Plague across the land. Only a woman pure of heart can bring an end to his reign of horror."],["The Sentinel","A young woman moves into an apartment in a building which houses a sinister evil."],["Absentia","A woman and her sister begin to link a mysterious tunnel to a series of disappearances, including that of her own husband."],["Deathwatch","In the middle of World War I, nine British soldiers caught behind enemy lines seek refuge in a complex network of German trenches. What they soon discover is that they aren't alone - and it isn't a German soldier that's hunting them down."],["Shock","A couple is terrorized in their new house haunted by the vengeful ghost of the woman's former husband who possesses her young son."],["Wolfen","A New York cop investigates a series of brutal deaths that resemble animal attacks."],["Lady in White","An author tells the story of how, as a young boy growing up in a 1960s small town, he was haunted after witnessing the murder of a little girl."],["In a Glass Cage","A former nazi child-killer is confined in an iron lung inside an old mansion after a suicide attempt. His wife hires him a full-time carer, a mysterious young man who is driven slowly mad by the old man's disturbing past."],["Fear(s) of the Dark","Several scary black-and-white animated segments in different styles appeal to our fear(s) of the dark."],["Parents","A young boy living in 1950s suburbia suspects his parents are cannibalistic murderers."],["Anguish","A controlling mother uses telepathic powers to send her middle-aged son on a killing spree."],["Fire in the Sky","An Arizona logger mysteriously disappears for five days in an alleged encounter with a flying saucer in 1975."],["Lunacy","A man takes up residence with a mysterious marquis and is soon persuaded to enter into an asylum for preventative therapy. Things are not what they seem, and the marquis may be even more sinister than what the young man may've predicted."],["The Sender","A disturbed telepathic man is unable to fully control his ability to transmit his dreams and visions into the minds of the people around him, or even influence reality. A female therapist tries to help him, but his mother gets in the way."],["Brand Upon the Brain!","Returned home to his long-estranged mother upon a request from her deathbed, a man raised by his parents in an orphanage has to confront the childhood memories that have long haunted him."],["The Sect","A lonely kindergarten teacher discovers a secret well in the basement of her house, and soon finds herself being followed by a murderous Satanic cult."],["We Are What We Are","The Parkers, a reclusive family who follow ancient customs, find their secret existence threatened as a torrential downpour moves into their area, forcing daughters Iris and Rose to assume responsibilities beyond those of a typical family."],["Evil Dead Trap","A TV station employee takes a camera crew out to an abandoned factory to investigate a purported snuff film that was made there, only to end up running for her life when a small, fetus-like creature murders her crew."],["The House of the Laughing Windows","Stefano, a young restorer, is commissioned to save a controversial mural located in the church of a small, isolated village."],["Curtains","Six young actresses auditioning for a movie role at a remote mansion are targeted by a mysterious masked murderer."],["Love Me Deadly","A young socialite struggling to control her necrophiliac urges is torn between her affection for a kind businessman and the mortician who supplies her with bodies."],["Sisters","A fledgling Staten Island journalist witnesses a brutal murder in the neighboring apartment of a French-Canadian model, but the police do not believe that the crime took place. With the help of a private detective, she seeks out the truth."],["The Iron Rose","A young couple out for a walk decide to take a stroll through a large cemetery. As darkness begins to fall they realize they can't find their way out, and soon their fears begin to overtake them."]]
