[["Throne of Blood","A war-hardened general, egged on by his ambitious wife, works to fulfill a prophecy that he would become lord of Spider's Web Castle."],["The Ox-Bow Incident","When a posse captures three men suspected of killing a local farmer, they become strongly divided over whether or not to lynch the men."],["The Spy Who Came in from the Cold","British Agent Alec Leamas (Richard Burton) refuses to come in from the Cold War during the 1960s, choosing to face another mission, which may prove to be his final one."],["To Live and Die in L.A.","A fearless Secret Service agent will stop at nothing to bring down the counterfeiter who killed his partner."],["Run Silent Run Deep","A U.S. sub commander, obsessed with sinking a certain Japanese ship, butts heads with his first officer and crew."],["Nanook of the North","In this silent predecessor to the modern documentary, film-maker Robert J. Flaherty spends one year following the lives of Nanook and his family, Inuits living in the Arctic Circle."],["Spies","The mastermind behind a ubiquitous spy operation learns of a dangerous romance between a Russian lady in his employ and a dashing agent from the government's secret service."],["Hour of the Wolf","While vacationing on a remote Scandanavian island with his younger pregnant wife, an artist has an emotional breakdown while confronting his repressed desires."],["Breaker Morant","Three Australian lieutenants are court martialed for executing prisoners as a way of deflecting attention from war crimes committed by their superior officers."],["The Damned United","The story of the controversial Brian Clough's 44-day reign as the coach of the English football club Leeds United."],["Kind Hearts and Coronets","A distant poor relative of the Duke of D'Ascoyne plots to inherit the title by murdering the eight other heirs who stand ahead of him in the line of succession."],["Straw Dogs","A young American and his English wife come to rural England and face increasingly vicious local harassment."],["The Filth and the Fury","A film about the career of the notorious punk rock band, the Sex Pistols."],["The War of the Roses","A married couple try everything to get each other to leave the house in a vicious divorce battle."],["Calcutta","With minimal narration by the director and very little context this is a kaleidoscope of stunning visuals from Calcutta, a city of 8,000,000 in the late 1960's: rich and poor, exotic and ... See full summary »"],["Sweet Smell of Success","Powerful but unethical Broadway columnist J.J. Hunsecker coerces unscrupulous press agent Sidney Falco into breaking up his sister's romance with a jazz musician."],["The 3 Penny Opera","In London at the turn of the century, the bandit Mack the Knife marries Polly without the knowledge of her father, Peachum, the 'king of the beggars'."],["Faces","A middle-aged man leaves his wife for a younger woman. Shortly after, his ex-wife also begins a relationship with a younger partner. The film follows their struggles to find love amongst each other."],["Behold a Pale Horse","Famous Spanish bandit Artiguez returns to his native Spanish village after 20 years in French exile but Spanish cop Vinolas is setting a trap for him."],["The Ascent","Two Soviet partisans on a mission to gather food contend with the winter cold, the occupying Germans, and their own psyches."],["American Boy: A Profile of - Steven Prince","Director Martin Scorsese talks to actor Steven Prince about his past. As the night goes on, Prince reveals some very amusing and moving stories of his experiences with drugs and violence."],["Hud","Honest and hard-working Texas rancher Homer Bannon has a conflict with his unscrupulous, selfish, arrogant and egotistical son Hud, who sank into alcoholism after accidentally killing his brother in a car crash."],["The Trials of Henry Kissinger","A film about the war crimes of the American diplomat, Henry Kissinger."],["The Servant","Upper-class Tony hires servant Hugo Barrett, who turns out to have a hidden agenda."],["Power","The story of life in the 18th century Jewish ghetto of Wurtemburg. Suess tries to better himself with the help of an evil Duke."],["I Confess","A priest, who comes under suspicion for murder, cannot clear his name without breaking the seal of the confessional."],["Sherlock Jr.","A film projectionist longs to be a detective, and puts his meagre skills to work when he is framed by a rival for stealing his girlfriend's father's pocketwatch."],["Bigger Than Life","A seriously ill schoolteacher becomes dependent on a \"miracle\" drug that begins to affect his sanity."],["Kippur","The film takes place in 1973 during the Yom Kippur War in which Egypt and Syria launched attacks in Sinai and the Golan Heights. The story is told from the perspective of Israeli soldiers. ... See full summary »"],["The Unknown","A criminal on the run hides in a circus and seeks to possess the daughter of the ringmaster at any cost."],["Prince of the City","A New York City narcotics detective reluctantly agrees to cooperate with a special commission investigating police corruption. However, he soon discovers that he's in over his head, and nobody can be trusted."],["The Picture of Dorian Gray","A corrupt young man somehow keeps his youthful beauty, but a special painting gradually reveals his inner ugliness to all."],["La Jetée","The story of a man forced to explore his memories in the wake of World War III's devastation, told through still images."],["Pépé le Moko","A wanted gangster is both king and prisoner of the Casbah. He is protected from arrest by his friends, but is torn by his desire for freedom outside. A visiting Parisian beauty may just tempt his fate."],["All Quiet on the Western Front","A young soldier faces profound disillusionment in the soul-destroying horror of World War I."],["Reversal of Fortune","Wealthy Sunny von Bülow lies brain-dead, husband Claus guilty of attempted murder; but he says he's innocent and hires Alan Dershowitz for his appeal."],["The Pawnbroker","A Jewish pawnbroker, victim of Nazi persecution, loses all faith in his fellow man until he realizes too late the tragedy of his actions."],["Eyes Without a Face","A surgeon causes an accident which leaves his daughter disfigured, and goes to extremes to give her a new face."],["The Onion Field","An LA police officer is murdered in the onion fields outside of Bakersfield. However, legal loopholes could keep his kidnappers from receiving justice, and his partner is haunted by overwhelming survivor's guilt."],["Vivre Sa Vie","Twelve episodic tales in the life of a Parisian woman and her slow descent into prostitution."],["The Seventh Continent","A European family who plan on escaping to Australia, seem caught up in their daily routine, only troubled by minor incidents. However, behind their apparent calm and repetitive existence, they are actually planning something sinister."],["The Body Snatcher","A ruthless doctor and his young prize student find themselves continually harassed by their murderous supplier of illegal cadavers."],["The Prowler","When Susan Gilvray reports a prowler outside her house police officer Webb Garwood investigates and sparks fly. If only her husband wasn't in the way."],["The Prisoner","A Cardinal is arrested for treason against the state. As a Prince of his church, and a popular hero of this people, for his resistance against the Nazis during the war, and afterward his ... See full summary »"],["The Go-Between","A tale of torrid and forbidden love between a couple in the English countryside."],["The Train","In 1944, a German colonel loads a train with French art treasures to send to Germany. The Resistance must stop it without damaging the cargo."],["Investigation of a Citizen Above Suspicion","A chief of detectives, homicide section, kills his mistress and deliberately leaves clues to prove his own responsibility for the crime."],["This Sporting Life","Despite success on the field, a rising rugby star senses the emerging emptiness of his life as his inner angst begins to materialize through aggression and brutality, so he attempts to woo his landlady in hopes of finding reason to live."],["Baby Doll","A steamy tale of two Southern rivals and a sensuous nineteen-year-old virgin."],["Knife in the Water","On their way to a sailing trip, an aging husband and wife invite along an emphatic young hitchhiker out of sheer patronization."],["The Magician","A traveling magician and his assistants are persecuted by authorities in Sweden of the 19th century. Their captures, however, didn't bring victory to those in power."],["Fox and His Friends","A young West German working-class man wins the lottery and initiates a relationship with a man above his social standing."],["The Swimmer","A man spends a summer day swimming as many pools as he can all over a quiet suburban town."],["The Cook, the Thief, His Wife & Her Lover","The wife of an abusive criminal finds solace in the arms of a kind regular guest in her husband's restaurant."],["Fists in the Pocket","A young man takes drastic measures to rid his dysfunctional family of its various afflictions."],["Seconds","An unhappy middle-aged banker agrees to a procedure that will fake his death and give him a completely new look and identity - one that comes with its own price."],["I Live in Fear","An aging Japanese industrialist becomes so fearful of nuclear war that it begins to take a toll on his life and family."]]
